
## Plan Result (terraform)

[CI link](https://github.com/tooruuetani/gh-actions-test/actions/runs/8641144349)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.main


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "test-274-ecr-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository_name = "test-274-ecr-repository"
  + repository_url  = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":2,"Program":"tfcmt","SHA1":"0152e5f0222799a6b0b0d532d3dab405d12e8744","Target":"terraform","Vars":{},"WorkflowName":"common-check"} -->